import { PrivacyPolicyData } from './types';

export const privacyPolicyData: PrivacyPolicyData[] = [
  {
    id: 'general',
    title: 'Загальні положення',
    orderedLists: [
      'Ця Політика конфіденційності (надалі – «Політика») розроблена у відповідності до діючого законодавства України, в тому числі, але не виключно, Закону України «Про захист персональних даних» від 01 червня 2010 року № 2297-VI щодо Користувачів Порталу PetsHelp і встановлює порядок отримання, збору, накопичення, зберігання, обробки, використання, забезпечення захисту і розкриття персональних даних (надалі – «Дані») Користувачів Сайту.',
      'Під Даними розуміється будь-яка інформація, що прямо чи опосередковано відноситься до конкретного Користувача. Це може бути: ім’я, прізвище, адреса електронної пошти, номер телефону, регіон проживання, ір-адреса, дані про пристрої (комп’ютер, тип браузера, операційна система мобільного пристрою), що використовуються Користувачем, повідомлення (інформація, яка міститься в переписці між Користувачами, а також в переписці з Адміністратором Порталу), інша інформація, за допомогою якої здійснюється комунікація, яка по бажанню Користувача надається ним за допомогою реєстраційної форми та/або при заповненні власного Профілю на Порталі, при написанні повідомлення чи відгуку, або інформація отримана при усній комунікації Користувача і Адміністрації Порталу.',
      'Під обробкою Даних розуміється будь-які дії з Даними в тому числі, але не виключно: доступ, надання, розповсюдження, збір, систематизація, зберігання, накопичення, запис, передача, блокування, видалення, уточнення, оновлення та/або зміна, знеособлення та інші способи використання Даних Компанією.',
      'Користувачі можуть надавати Дані самостійно шляхом розміщення таких даних на Порталі або повідомляючи через канали телефонного зв’язку та/або на електронну та/або поштову адресу.',
      'Користувач не має право використовувати сервіс PetsHelp, якщо він не погоджується з умовами даної Політики. Користувач визнає, що у випадку його недбалого ставлення до безпеки і захисту своїх Даних і даних по авторизації (пароль, логін) треті особи можуть отримати несанкціонований доступ до облікового запису і Даних Користувача.',
    ],
  },
  {
    id: 'data-collection',
    title: 'Дані які можуть збиратись',
    description: [
      {
        text: 'Сервіс може збирати наступні Дані:',
      },
    ],
    orderedLists: [
      'Ім’я, прізвище, по батькові, дата народження, адреса фактичного проживання, місце реєстрації, стать, сімейний стан, номер (та серію) паспорту або іншого документу, що посвідчує особу, строк його дії, фотографія, дані уповноваженої особи компанії, найменування компанії, реквізити компанії, контактні телефони, адреса електронної пошти, адреса місцезнаходження компанії, інші контакті дані за бажанням Користувача;',
      'Інформація про обліковий запис Користувача в тому числі номер телефону, адреса електронної пошти, логін та пароль, інші Дані, необхідні для здійснення обслуговування Користувачів Порталу, комунікації з Користувачами в тому числі, коли Користувач звертається в службу підтримки Порталу;',
      'Інформація, яка необхідна для здійснення комунікації між Користувачами Порталу в тому числі для здійснення і підтвердження замовлень між Замовниками та Виконавцями, отримання і відправки повідомлень, розміщення відгуків, коментарів, здійснення платежів;',
      'Дані про пристрої, що використовуються Користувачами, інформація про мобільні Дані Користувачів (у випадку, якщо Користувач використовує мобільні додатки) такі як: ір-адреса; дата та час коли Користувач користується Порталом, інформація про програмне забезпечення, а також інтернет-браузер, що використовувався Користувачем, інформація про операційну систему мобільного пристрою, інформація про роботу пристроїв Користувача, індивідуальні ідентифікатори пристроїв, які використовують Користувачі;',
      'Дані, отримані в результаті проведення Компанією та/або третіми уповноваженими Компанією особи різних опитувань, пов’язаних із покращенням надання сервісу Користувачам; інформація, отримана Компанією в результаті проведення маркетингової діяльності;',
      'Інформація, розміщена Користувачами по результатам їх обслуговування, відгуки, коментарі, звернення в службу підтримки клієнтів, скарги, претензії, інші звернення.',
    ],
  },
  {
    id: 'usage',
    title: 'Використання і цілі обробки даних',
    description: [
      {
        text: 'Сервіс використовує та здійснює обробку Даних, в наступних цілях:',
        unorderedLists: [
          'здійснення покладених на Компанію функцій, повноважень та обов’язків у відповідності до діючого законодавства України, також забезпечення реалізації цивільно-правових, господарських та податкових відносин;',
          'для реєстрації, ідентифікації клієнта як Користувача Порталу, за для зв’язку з Користувачем в тому числі для надання послуг, обробки платежів, проведення розрахункових операцій, надання звітності, введення бухгалтерського та управлінського обліку, створення і реалізації бонусних програм, програм захисту Користувачів, відправки розсилок поштою, електронною поштою, в тому числі з метою відправки комерційних пропозицій, повідомлень про акції та інших новин PetsHelp, за для покращення якості надання послуг, формування рейтингів, аналізу активності Користувачів, здійснення пошуку по ключовим словам, управління трафіком на Порталі, аналізу і прогнозування уподобань, інтересів Користувачів; проведення науково-дослідної та аналітичної активності, а також забезпечення дотримання умов Користувачами даної Політики.',
        ],
      },
      {
        text: 'Компанія не здійснює обробку даних, які стосуються расової, національної приналежності, політичних поглядів, релігійних та інших переконань, членства в громадських організаціях. Інформація, яка характеризує фізіологічні особливості Користувачів, на основі яких можна встановити їх особистість не обробляються також.',
      },
      {
        text: 'Строки обробки та зберігання Даних визначаються виходячи із цілей обробки Даних, а також виходячи із умов, вказаних в договорах, укладених з Користувачами у відповідності до вимог діючого законодавства України.',
      },
    ],
  },
  {
    id: 'access',
    title: 'Умови надання доступу до даних',
    description: [
      {
        text: 'Розкриття Даних відбувається при розміщенні Виконавцем Оголошення, розміщенні Виконавцем пропозиції на адресу Замовника, розміщенні Завдання Замовником, акцепту пропозиції Виконавця Замовником Завдання або програмою Сайту автоматично на сервісі PetsHelp, але тільки в об’ємі необхідному для ідентифікації Користувача та завдання.',
      },
      {
        text: 'В окремих випадках, з метою демонстрації ефективності роботи Порталу та підвищення іміджу Порталу, Компанія може розкривати статистику роботи сайтів Користувачів, не розкриваючи при цьому персональні дані та інформацію, яка являється комерційною таємницею.',
      },
      {
        text: 'На Порталі можуть міститись посилання на інші веб-ресурси, на які дія даної Політики не розповсюджується.',
      },
      {
        text: 'Сервіс здійснює обробку Даних на законній та справедливій основі. Дані не розкриваються третім особам і не розповсюджуються без згоди Користувача, за виключенням випадків передбачених діючим законодавством України і лише в інтересах національної безпеки, економічного добробуту і прав людини, зокрема, але не виключно:',
        unorderedLists: [
          'за обґрунтованими запитами органів державної влади, які володіють правом витребувати та отримувати такі Дані;',
          'в тому випадку, якщо на думку сервісу, Користувач порушує умови даної Політики та/або інших договорів та угод .',
        ],
      },
      {
        text: 'Сервіс залишає за собою право у відповідності із вимогами діючого законодавства України здійснювати обмін Даними з органами державної влади з метою: попередження шахрайства на Порталі; врегулювання спірних ситуацій та з’ясування обставин, які є/можуть стати причиною порушення діючого законодавства, а також у випадку виявлення Компанією неправомірних дій Користувачів Порталу та/або отримання претензій, скарг, звернень третіх осіб.',
      },
    ],
  },
  {
    id: 'modify-delete',
    title: 'Як змінити або видалити дані',
    description: [
      {
        text: 'Користувачі в будь-який момент можуть змінити/видалити особисту інформацію або відмовитися від розсилки, або відкликати згоду на обробку Даних відправивши повідомлення на електронну адресу: petshelp_support@gmail.com.',
      },
      {
        text: 'Після отримання такого повідомлення обробка Даних Користувача буде припинена, а його Дані будуть видалені, окрім випадків, коли підставою обробки Даних є необхідність захисту законних інтересів Компанії з метою захисту від шахрайських дій та/або дій, що можуть завдати шкоди Сервісу, Компанії та іншим користувачам сервісу, а також якщо така обробка може бути необхідна у відповідності із діючим законодавством України.',
      },
      {
        text: 'Функціонування деяких можливостей PetsHelp, для яких необхідна наявність інформації про Користувача, може бути призупинена з моменту зміни/видалення Даних.',
      },
      {
        text: 'Сервіс здійснює обробку та зберігання Даних для реалізації цілей, вказаних в цій Політиці на протязі всього необхідного періоду для цього, але не більше 5 (п’яти) років з дати останньої взаємодії Користувача з Сервісом.',
      },
    ],
  },
  {
    id: 'protection',
    title: 'Захист даних',
    description: [
      {
        text: 'Сервіс, при обробці Даних застосовує всі необхідні технічні, організаційні, правові заходи для захисту Даних від неправомірного та/або несанкціонованого доступу до таких Даних, в тому числі від змін, видалення, надання, розповсюдження, а також інших неправомірних дій.',
      },
      {
        text: 'Компанія на постійній основі здійснює контроль за прийнятими заходами щодо забезпечення безпеки. ',
      },
      {
        text: 'Компанія залишає за собою право змінити умови даної Політики в будь-який момент. В такому випадку, оновлена редакція буде розміщена на сторінці сервісу PetsHelp.',
      },
      {
        text: 'У випадку, якщо які-небуть положення цієї Політики, включаючи будь-які пропозиції, пункт або їх частини, визнаються такими, що суперечать діючому законодавству України, або такими, що є недійсними, це не впливає на інші положення даної Політики, вони залишаються повністю чинні і продовжують діяти в повній мірі і являються дійсними, а будь-яке інше недійсне положення або положення, яке не може бути виконаним, без подальших дії Сторін, вважається зміненим, виправленим в тій мірі, в якій це необхідно для забезпечення його дійсності і можливості виконання.',
      },
    ],
  },
];
