import { PublicOfferTerms } from './types';

export const publicOfferData: PublicOfferTerms[] = [
  {
    title: 'Загальні положення',
    description:
      'Цей документ є відкритою пропозицією (далі - "Оферта") Сервісу PetsHelp, яка адресована невизначеному колу осіб, укласти договір про надання послуг (далі - "Договір") на викладених в цій Оферті умовах, включаючи всі її додатки.',
    lists: [
      {
        text: 'Компанія публікує цю Оферту на інтернет-сайті PetsHelp. Оферта набуває чинності з моменту її розміщення на сайті: PetsHelp.',
      },
      {
        text: 'Відповідно до ст. 638 Цивільного кодексу України, в разі прийняття викладених в Оферті умов і оплати послуг, фізична або юридична особа, яка провадить акцепт цієї Оферти, стає Користувачем (акцепт Оферти рівнозначний укладенню Договору на умовах, викладених в Оферті).',
      },
      {
        text: 'Компанія залишає за собою право вносити зміни в Оферту (в тому числі в опис послуг, тарифів, порядку оплати) і / або відкликати Оферту в будь-який момент на свій розсуд. У разі внесення змін, такі зміни вступають в силу з моменту розміщення оновленої редакції Оферти на сайті відповідно до положень п. 1.2. цієї Оферти, якщо інше не зазначено в Оферті.У цій Оферті, якщо контекст не вимагає іншого, наведені нижче терміни мають таке значення: Авторизація — введення зареєстрованим Користувачем своїх логіна і пароля та введення коду-підтвердження для доступу до Сервісів Виконавця і входу в Особистий кабінет.',
      },
      {
        text: 'Адміністрація Сайту — Компанія і / або інші особи (субпідрядники), уповноважені належним чином Компанією на управління Сайтом і надання Сервісів Користувачам при використанні Сайту відповідно до цього Договору.',
      },
      {
        text: 'Баланс — рахунок Користувача на Сайті, що відображає суму перерахованих Користувачем Компанії грошових коштів в якості Гарантійного платежу, який може використовуватися для оплати за надані Компанією Сервіси Користувачеві.',
      },
      {
        text: "Вибір Виконавця — акцепт Пропозиції Виконавця Замовником Завдання або програмою Сайту автоматично (при вказівці Замовником такого типу вибору Виконавця при створенні Завдання). При цьому здійснювати Вибір Виконавця самостійно можуть тільки ті Замовники, які залишили вже 5 (п'ять) і більш Відгуків.",
      },
      {
        text: 'Виконавець — Користувач, що пройшов процедуру реєстрації та перевірки на Сайті відповідно до умов цього Договору, який розміщує Оголошення та Пропозиції на Сайті відповідно до умов цього Договору.',
      },
      {
        text: 'Відгук — коментарі Користувача на Сайті з приводу його взаємин з іншим Користувачем в процесі надання послуг / виконання робіт.',
      },
      {
        text: "Гарантійний платіж — грошова сума, яка перераховується Виконавцем на банківський рахунок Компанії і відображається на Балансі і є, узгодженим Сторонами (Виконавцем і Компанією) відповідно до положень ч. 2 ст. 546 Цивільного кодексу України, способом забезпечення виконання грошових зобов'язань Виконавцем перед Компанією стосовно оплати Компанії наданого доступу і Сервісів.",
      },
      {
        text: 'Додаткові послуги Компанії — Підняття профілю Виконавця та Доступ до програмного забезпечення, що надає функціональну можливість здійснювати поповнення Балансу платіжною карткою та здійснює відображення збережених платіжних карт Виконавця.',
      },
      {
        text: 'Завдання або Замовлення — інформація, розміщена Замовником на Сайті, адресована зацікавленим Виконавцям, яка містить запит на надання/виконання послуг/робіт в певній категорії.',
      },
      {
        text: 'Завдання, закриті за Виконавцем — завдання, виконані Виконавцем і закриті Замовником або програмою Сайту автоматично в результаті бездіяльності Замовника або Виконавця більше 5-ти календарних днів з дати закінчення терміну виконання / надання робіт / послуг, зазначеного в Завданні.',
      },
      {
        text: 'Замовник — Користувач, що пройшов на Сайті процедуру реєстрації та розміщує Завдання на Сайті відповідно до умов цього Договору, а також самостійно та / або програмою Сайту автоматично, здійснює Вибір Виконавця для отримання послуг / результатів робіт з виконання Завдання.',
      },
      {
        text: 'Зображення — фотографії (аватари) Користувачів, прикріплені фото до Завдань, прикріплені фото/зображення до Оголошень, додані фото/зображення, як приклад виконаних робіт в портфоліо Виконавця.',
      },
      {
        text: 'Користувач — будь-яка дієздатна фізична особа, фізична особа-підприємець або юридична особа, яка прийняла умови цього Договору і користується Сервісами Компанії. Користувач може зареєструватися на Сайті як Замовник та / або Виконавець.',
      },
      {
        text: 'Логін — ідентифікатор Користувача при авторизації на Сайті, який він використовує в процесі користування Сервісами Компанії відповідно до цього Договору. Як Логін використовуються номер мобільного телефону або адреса електронної пошти Користувача. Забороняється реєструвати і використовувати кілька Логінів одним і тим же Користувачем. При цьому не допускається використання Користувачем Логіна, який вже був використаний іншим Користувачем.',
      },
      {
        text: 'Обліковий запис — електронний кабінет Користувача (аккаунт) в функціональній системі Сайту, за допомогою якого він може керувати своїми Сервісами.',
      },
      {
        text: 'Оголошення — розміщення на Сайті пропозиції Виконавця у вигляді повідомлень - тексту і графічних зображень, що описують досвід роботи і компетентність Виконавця в конкретній категорії надання робіт/послуг.',
      },
      {
        text: "Особистий кабінет — сторінка зареєстрованого Користувача на Сайті, за допомогою якої зареєстрований Користувач здійснює управління своїм Обліковим записом (акаунтом) та Балансом (якщо є) і містить наступну інформацію: загальні налаштування профілю, налаштування повідомлень, зміна пароля, зміна категорій і міст виконання завдання, додавання оголошень, портфоліо та інформації про ціну послуг/робіт виконавця, управління прив'язаними картами, поповнення гарантійного платежу, виписки, дашборда виконавця і замовника.",
      },
      {
        text: 'Пароль — символьна комбінація, призначена автоматично програмним забезпеченням Сайту в момент реєстрації (надалі Користувач може самостійно змінити пароль), що забезпечує в сукупності з логіном ідентифікацію Користувача при використанні Сервісів Компанії, які надаються відповідно до цього Договору.',
      },
      {
        text: "Правила користування Сайтом — докладний опис Сервісів Компанії, включаючи їх вартість, а також правила роботи з Сервісом Виконавцем і Замовником. Правила користування Сайтом є невід'ємною частиною Договору",
      },
      {
        text: 'Приватна інформація в Завданні — сервіс, що дозволяє Замовнику розмістити додаткову інформацію (наприклад додатковий номер телефону, адреса, ін.) в Завданні, що деталізує характер робіт / послуг, які замовляються та яка буде доступна для перегляду лише обраному Виконавцю. Приватна інформація не може містити дані, що змінюють існуючі умови Завдання.',
      },
      {
        text: 'Пропозиція — оферта Виконавця, що розміщується на Сайті, на адресу Замовників укласти з ним договір на надання послуг / виконання робіт відповідно до Завдання Замовника.',
      },
      {
        text: 'Публічний Профіль Виконавця — це сторінка Виконавця на якій Виконавець самостійно розміщує (в тому числі редагує, видаляє і додає) інформацію про себе, види і опис послуг та/або робіт, які надає Виконавець, завантажує фотографії, відео, Пропозиції, а також розміщуються Відгуки Замовників і вказується статус: ТОП-Фахівець/Виконавець.',
      },
      {
        text: 'Реєстрація — процедура заповнення Користувачем реєстраційної форми на Сайті, після затвердження якої Компанією, такій особі присвоюється відповідний логін і пароль для доступу до Сервісів Компанії та персональної сторінки (Публічному профілю Виконавця) зареєстрованого Користувача.',
      },
    ],
  },
  {
    title: 'Порядок надання і використання Сервісів Компанії',
    description:
      'Цей документ є відкритою пропозицією (далі - "Оферта") Сервісу PetsHelp, яка адресована невизначеному колу осіб, укласти договір про надання послуг (далі - "Договір") на викладених в цій Оферті умовах, включаючи всі її додатки.',
    lists: [
      {
        text: "Особа, яка бажає стати Користувачем, зобов'язана пройти процедуру реєстрації на відповідній сторінці Сайту. При реєстрації Користувач зобов'язується надати в реєстраційній формі (анкеті) достовірну, повну і точну інформацію про себе і забезпечувати її актуальність і повноту. Користувач зобов'язується не вводити Компанію і / або інших Користувачів в оману щодо своєї особи / найменування, а також не розміщувати на Сайті адреси, номери телефонів, адреси електронної пошти, паспортні / реєстраційні дані та іншу інформацію будь-яких третіх осіб. У разі виявлення Адміністрацією Сайту недостовірної інформації, яку розмістив Користувач, або інформації, що може вводити в оману інших Користувачів, Адміністрація Сайту має право відмінити таку реєстрацію та / або призупинити її і / або припинити надання доступу до Сервісів Сайту і надання послуг з використання Сервісів і / або вимагати додаткові документи для перевірки такої, розміщеної Користувачем інформації. В такому випадку Адміністрація Сайту направляє відповідне повідомлення Користувачу.",
      },
      {
        text: 'Користувач несе відповідальність за дотримання прав (майнових та немайнових) третіх осіб щодо інформації, переданої (наданої) Компанії при реєстрації Користувача, використанні Сайту і отриманні Сервісів Компанії. З моменту реєстрації на Сайті Користувач дає згоду і погоджується на обробку Компанією персональних даних Користувача, зазначених ним при реєстрації, (збір, реєстрація, накопичення, зберігання, адаптування, зміна, поновлення, уточнення, використання і поширення, реалізація, передача, знеособлення, знищення ) з метою забезпечення можливості надання Послуг, а також з метою інформаційного обслуговування Користувача.',
      },
      {
        text: 'Користувач погоджується з тим, що дії, вчинені на Сайті після реєстрації Користувача, визнаються діями Користувача. Користувач несе повну відповідальність за збереження конфіденційності його Облікового запису (в тому числі Логіна і Пароля) і за діяльність, яка відбувається з його Обліковим записом.',
      },
      {
        text: 'Користувач не має права передавати, продавати, передавати в користування тощо свої Логін і Пароль для доступу до Сайту і Сервісів Компанії третім особам без згоди Компанії. У разі передачі Логіна і Пароля будь-якій третій особі, всю відповідальність за дії такої третьої особи несе Користувач.',
      },
      {
        text: 'У разі порушення безпеки або несанкціонованого використання Облікового запису Користувача, він повинен негайно повідомити про це Компанію. Компанія не несе відповідальності за будь-які збитки, спричинені несанкціонованим використанням Облікового запису Користувача.',
      },
      {
        text: "Реєструючись, Користувач погоджується на отримання інформаційних повідомлень на вказану при реєстрації адресу електронної пошти та / або номер мобільного телефону. Після проходження процедури реєстрації Виконавець зобов'язаний пройти процедуру перевірки, під якою розуміється надання Компанії персональних / реєстраційних даних Виконавця і їх підтвердження. Для проходження процедури перевірки Виконавцю-фізичній особі необхідно надати селфі з паспортом у вигляді книжечки (на фотографії паспорт в розгорнутому вигляді з актуальною фотографією повинен бути на рівні очей і відстані не більше, ніж 20 см від обличчя Користувача; така фотографія повинна бути читабельною) або id-карти; для іноземців та осіб без громадянства допускається надання селфі з посвідкою на постійне проживання (у вигляді книжечки або id-карти) та посвідкою на тимчасове проживання (у вигляді id-карти). Фотографія видаляється протягом 24 годин після завершення перевірки. Виконавець-фізічна особа може скористуватися Шерингом документів від Дія (детальніше за посиланням https://paperless.diia.gov.ua/instruction/sering ) та поділитися копією (на вибір): біометричного паспорту: (ID-картка, закордонний паспорт) чи посвідчення водія.",
      },
      {
        text: 'Для проходження процедури перевірки Виконавцю-фізичній особі-підприємцю необхідно надати свідоцтво про державну реєстрацію та/або виписку/витяг з Єдиного державного реєстру юридичних осіб, фізичних осіб - підприємців (далі також - ЄДР).',
      },
      {
        text: "Для проходження процедури перевірки Виконавцю-юридичній особі необхідно надати Компанії свідоцтво про державну реєстрацію юридичної особи та/або виписку/витяг з ЄДР, а також документи, що підтверджують повноваження відповідного представника юридичної особи на вчинення дій від його імені, пов'язаних із замовленням Сервісів Компанії по цього Договору, засвідчену за допомогою накладання КЕП такої фізичної-особи підприємця.",
      },
      {
        text: 'Для проходження процедури перевірки Виконавцю-фізичною особою, що провадить незалежну професійну діяльність необхідно надати Компанії довідку про взяття на облік платника податків, відомості щодо якого не підлягають включенню до ЄДР та документ (дозвіл, сертифікат тощо), що підтверджує право фізичної особи на провадження незалежної професійної діяльності, засвідчену за допомогою накладання КЕП такої фізичної-особи підприємця.',
      },
      {
        text: 'Після проходження перевірки Виконавець отримує статус “Перевіреного фахівця”.',
      },
      {
        text: 'Адміністрація Порталу має право відправити Виконавця на повторне проходження перевірки у випадку наявності запиту Виконавця про зміну/уточнення інформації про себе або зміну Логіну, а також у випадку наявності підозри щодо потенційних шахрайських дій з Обліковим записом Виконавця.',
      },
      {
        text: 'Відразу після отримання на вказаний номер телефону смс-повідомлення про підтвердження реєстрації Користувач отримує доступ до Особистого кабінету і йому присвоюється унікальний ID-номер.',
      },
      {
        text: 'Користувач має право в будь-який час припинити використання Сервісів Компанії, повідомивши про це Компанію шляхом направлення відповідного повідомлення.',
      },
      {
        text: 'Компанія не гарантує доступність Сайту і Сервісів цілодобово. Компанія має право в будь-який момент відмовити будь-якому Користувачеві в використанні Сервісів в будь-який час та без пояснення причин.',
      },
      {
        text: 'Користувачеві надається доступ до сервісу особистих повідомлень. Під сервісом особистих повідомлень розуміється можливість розміщення Користувачем на сторінках Сайту повідомлень і завантаження файлів, які є недоступними для огляду всіма Користувачами, а доступні тільки Замовнику Завдання і Обраному Виконавцю.',
      },
      {
        text: 'Забороняється розміщення особистих повідомлень і завантаження файлів, які:',
        subList: [
          'порушують чинне законодавство України;',
          'містять спам, схеми фінансових "пірамід";',
          'є незаконними, шкідливими, загрозливими, такими, що ображають моральність, наклепницькими, такими, що порушують авторські права або інші права інтелектуальної власності третіх осіб, які пропагують ненависть і / або дискримінацію людей за расовою, етнічною, статевою, соціальною ознаками;',
          'містять посилання на Інтернет-ресурси, що належать Користувачам або третім особам.',
        ],
      },
    ],
  },
  {
    title: 'Інтелектуальна власність',
    description:
      "Сукупність програм, даних, торгових марок, об'єктів інтелектуальної власності в тому числі об'єктів авторського права, і інших об'єктів, що використовуються на Сайті, є інтелектуальною власністю його законних правовласників і охороняється законодавством про інтелектуальну власність України, а також відповідними міжнародними правовими договорами і конвенціями. Будь-яке використання елементів, символіки, текстів, графічних зображень, програм та інших об'єктів, які входить до складу Сервісу, крім дозволеного в цьому Договорі, без дозволу Компанії чи іншого законного правовласника є незаконним і може послужити причиною для судового розгляду і притягнення порушників до цивільно-правової, адміністративної та кримінальної відповідальності відповідно до законодавства України.",
  },
  {
    title: 'Порядок вирішення спорів',
    description:
      "Користувач і Компанія погоджуються, що всі спори і розбіжності, які можуть виникнути з цього Договору або в зв'язку з ним, будуть вирішуватися шляхом переговорів з обов'язковим дотриманням досудового порядку вирішення спорів. Претензії Користувача відносно наданого Компанією Сервісу приймаються до розгляду тільки за умови, якщо вони складені в письмовій формі і спрямовані на поштову адресу Компанії протягом трьох місяців з дня надання Сервісу або відмови в його наданні.",
  },
  {
    title: 'Порядок внесення змін і доповнень до Договору',

    lists: [
      {
        text: 'Зміни та / або доповнення до Договору вносяться в односторонньому порядку за рішенням Компанії. Датою вступу в силу змін і / або доповнень до цього Договору є дата опублікування даних змін і / або доповнень на Сайті, якщо Компанією не вказано інше.',
      },
      {
        text: 'У разі незгоди Користувача з внесеними змінами та / або доповненнями до цього Договору, Користувач має право розірвати цей Договір шляхом повідомлення Компанії про відмову Користувача від подальшого використання Сервісів Компанії, а також про незгоду з внесеними змінами та / або доповненнями або про неприєднання до нової редакції договору або про відмову дотримуватися його умови.',
      },
      {
        text: 'Сторони домовляються, що мовчання (відсутність письмових повідомлень про розірвання Договору або про незгоду з окремими положеннями Договору, в тому числі зі зміною тарифів), а також продовження використання Сервісів Компанії, визнаються згодою і приєднанням боку до нової редакції Договору, до редакції Договору з урахуванням внесених змін і / або доповнень.',
      },
      {
        text: 'Заключні положенняЦей Договір і відносини між Компанією та Користувачем регулюються законодавством України. Питання, не врегульовані Договором, підлягають вирішенню відповідно до законодавства України.',
      },
      {
        text: 'Якщо з тих чи інших причин будь-які з умов цього Договору будуть визнані недійсними, це не впливає на дійсність або застосовність інших умов Договору.',
      },
      {
        text: 'Цей Договір щодо кожного з користувачів вступає в силу з моменту вчинення Користувачем одного з найбільш ранніх дій, зазначених у пункті 2.2. цього Договору та діє до моменту закінчення використання Користувачем Сервісів Компанії.',
      },
    ],
  },
];
